<!DOCTYPE HTML>
<HTML>
  <HEAD>
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <TITLE>Proyecto integrador &mdash; Matem&aacute;ticas discretas &mdash; Docencia &mdash;
      Schaeffer</title>
    <LINK rel="stylesheet" type="text/css" href="https://elisa.dyndns-web.com/teaching/elisa.teaching.css">
  </HEAD>
  <BODY>
    <div id="elementos">
      <div id="navibar">
	<p>
	  <a href="https://elisa.dyndns-web.com/espanol.html">Schaeffer</a> /
	  <a href="https://elisa.dyndns-web.com/teaching/espanol.html">Docencia</a> / 
	  <a href="index.html">Matem&aacute;ticas discretas</a> / 
	  Proyecto integrador
	</p>
      </div>
      <div ID="contenido">
	<h1>Proyecto integrador</h1>
	<h2>Matem&aacute;ticas discretas</h2>
	<p>
	  El alumno puede iniciar el proyecto una vez que haya
	  terminado las cinco tareas en l&iacute;nea (con puntaje
	  parcial o completa). Cada alumno propone un tema; todos los
	  temas deben ser revisados y aprobados por la profesora
	  <em>antes</em> de comenzar a trabajar en el proyecto. El
	  registro de tema menciona el t&iacute;tulo tentativo, los conceptos
	  de matem&aacute;ticas discretas que se planea incorporar y un
	  estimado del puntaje por obtener (m&aacute;ximo diez).
	</p>
	<p>
	  Se recomienda consultar con la profesora  en clase
	  antes de iniciar cada fase para recomendaciones, consejos y
	  una revisi&oacute;n de las fases anteriores. Las fases a
	  seguir son:
	</p>
	<ol>
	  <li><strong>Propuesta de tema</strong>: se identifica un
	  fen&oacute;meno/situaci&oacute;n que presenta un &aacute;rea
	  de oportunidad de mejora en alg&uacute;na forma de toma de
	  decisiones (por lo general un problema de
	  optimizaci&oacute;n, aunque problemas de decisi&oacute;n
	  tambi&eacute;n son posibles) que se pueda atender con los
	  conceptos y t&eacute;cnicas que se discuten en la unidad de
	  aprendizaje.</li>
	  <li><strong>Revisi&oacute;n de literatura</strong>: se busca
	  libros, art&iacute;culos, software, sitios web,
	  etc. relacionados con el tema y se resumen los hallazgos en
	  forma organizada con palabras propias; se incluye una
	  bibliograf&iacute;a completa y en formato consistente al
	  final del reporte, detallando los trabajos consultados.</li>
	  <li><strong>Modelado del problema</strong>: se expresa el
	  problema seleccionado en t&eacute;rminos de conceptos de las
	  matem&aacute;ticas discretas (por ejemplo l&oacute;gica,
	  conjuntos, relaciones, &aacute;rboles, grafos o una
	  combinaci&oacute;n de estos) con una notaci&oacute;n
	  matem&aacute;tica clara y consistente, definiendo los datos
	  de entrada, las restricciones, las variables, los objetivos
	  y las salidas deseadas.</li>
	  <li><strong>Instancias con datos verdaderos</strong>: se
	  obtiene informaci&oacute;n de uno o m&aacute;s casos
	  pr&aacute;cticos donde se presenta el problema y se
	  representan esos casos en t&eacute;rminos del modelo
	  planteado, citando en la bibliograf&iacute;a las fuentes de
	  informaci&oacute;n utilizadas.</li>
	  <li><strong>Dise&ntilde;o de la soluci&oacute;n
	  propuesta</strong>: se identifican y/o construyen una o
	  m&aacute;s t&eacute;cnicas (es decir, algoritmos) que
	  permiten resolver el problema planteado, explicando en
	  qu&eacute; consisten, a qu&eacute; se basan y c&oacute;mo
	  funcionan (citando referencias bibliogr&aacute;ficas donde
	  necesario).</li>
	  <li><strong>Implementaci&oacute;n</strong>: se detalla la
	  forma de ejecutar (por lo menos un) m&eacute;todo de
	  soluci&oacute;n, sea a mano o automatizado a trav&eacute;s
	  de un c&oacute;digo, para por lo menos una de las instancias
	  identificadas, paso por paso, de forma clara y consistente.</li>
	  <li><strong>Evaluaci&oacute;n</strong>: se analiza y discute
	  la calidad de la soluci&oacute;n propuesta en
	  t&eacute;rminos tales como precisi&oacute;n y eficiencia,
	  terminando con conclusiones sobre el trabajo realizado y
	  posibles mejoras que se le pudieran realizar en un
	  futuro.</li>
	</ol>
	<p>
	  En cada fase conviene consultar con la profesora en clase
	  por retroalimentaci&oacute;n; se pueden consultar
	  m&uacute;ltiples fases en una sola consulta, pero no se
	  permite llevar acabo proyectos sin haber consultado la
	  profesora (es decir, no se reciben reportes de proyectos
	  cuyo desarrollo no ha sido discutido en persona en
	  clase). Al mostrar avances a la profesora, ella podr&aacute;
	  indicar cosas que faltan o que no est&eacute;n a&uacute;n
	  satisfactoriamente atendidos en el reporte.
	</p>
	<p>
	  Al concluir las fases el alumno entrega su <stron>reporte
	  escrito</strong> (ojo, no se aceptan diapositivas tipo
	  PowerPoint), sin efectos decorativos, sin hoja portada, sin
	  color de fondo, un solo archivo en formato PDF (no se
	  aceptan otros formatos y <strong>no se aceptan entregas en
	  impreso</strong>) por correo electr&oacute;nico a la
	  profesora, indicando en el tema del correo que es un
	  proyecto de mates discretas, nombrando el
	  archivo <code>.pdf</code> con su n&uacute;mero de
	  matr&iacute;cula solamente. En el mensaje del correo (no en
	  el archivo) se menciona adem&aacute;s un estimado
	  actualizado del puntaje por obtener. <em>No incluir el
	  nombre del alumno dentro del documento. No incluir la
	  matr&iacute;cula en el contenido del documento, solamente en
	  el nombre del archivo.</em></p>
	<p>
	  Es importante comenzar el reporte con
	  un <strong>t&iacute;tulo</strong> que describe su tema
	  (ponerle "proyecto integrador de matem&aacute;ticas
	  discretas" no sustituye el t&iacute;tulo).  A cada fase se
	  atiende en el reporte con una secci&oacute;n que consiste en
	  texto original bien redactado, sin errores de
	  gram&aacute;tica, ortograf&iacute;a o puntuaci&oacute;n,
	  acompa&ntilde;ado con ilustraciones originales y cuadros que
	  cuentan con su texto descriptivo correpsondiente (en el caso
	  de que sean con licencia de reuso libre no comercial,
	  indicando fuente y tipo de licencia en el texto
	  descriptivo). Los textos descriptivos de los cuadros se
	  posicionan encima, mientras en figuras van por debajo.
	</p>
	<p>
	  Todas
	  las fuentes de consulta se indican claramente dentro del
	  texto con un estilo de ingenier&iacute;a y se detallan en
	  una secci&oacute;n de referencias al final del reporte. Es
	  importante entender que un listado de URLs <em>no
	  cuenta</em> como una bibliograf&iacute;a adecuada sino hay
	  que darle formato. La mejor forma de aclarar dudas es
	  mostrando un borrador a la profesora en clase para que ella
	  pueda orientar sobre el proceso correcto.
	</p>
<p>
  En el caso de contar con c&oacute;digo, se anexa al final del
  reporte en un formato adecuado con colores para
  sint&aacute;xis. Jam&aacute;s se usa capturas de pantalla para
  incluir c&oacute;digo. Capturas de pantalla sirven para mostrar el
  funcionamiento de un software, aunque en el caso de demostraciones
  es m&aacute;s recomendable grabar un video del escritorio con
  comentario en voz y subirlo a un repositorio en l&iacute;nea como
  por ejemplo YouTube y luego mencionar la URL de video en el
  reporte. Lo mismo sirve para prototipos f&iacute;sicos: primero
  incluir fotograf&iacute;as originales en la secci&oacute;n de
  implementaci&oacute;n y concluir con un video.
</p>
<p>
	  <span style="color:red"><strong>La fecha l&iacute;mite para
	  entrega de proyecto es el &uacute;ltimo d&iacute;a
	  h&aacute;bil anterior al examen ordinario a
	  mediod&iacute;a</strong></span> (ojo, no medianoche sino
	  mediod&iacute;a); para segunda oportunidad, es lo mismo pero
	  antes del examen extraordinario. La entrega no vale hasta
	  que la profesora haya contestado de recibido al correo, ya
	  que es com&uacute;n que alumnos anexan archivos rotos (a
	  veces a prop&oacute;sito) o escriben mal el correo. Todo lo
	  que llega despu&eacute;s de la hora indicada ya no cuenta
	  para la primera oportunidad, sino solamente se toma en
	  cuenta en el caso que el alumno ocupa presentar
	  extraordinario.
	</p>
	<p>
	  La calificaci&oacute;n es por m&aacute;ximo 10 puntos,
	  considerando la calidad, claridad y profundidad en la cual
	  se ha documentado cada fase del proyecto. Se reducen puntos
	  por errores de ortograf&iacute;a, mala
	  estructuraci&oacute;n, mala calidad de las ilustraciones,
	  errores t&eacute;cnicos e inconsistencias del reporte. No se
	  podr&aacute; mejorar un reporte ya entregado.
	</p>
<p>Reportes que
	  contienen elementos no originales (es decir, cualquier cosa
	  &mdash; figura, c&oacute;digo, p&aacute;rrafo de texto
	  &mdash; que no est&eacute;n hechos por el alumno mismo)
	  resultar&aacute; en una calificaci&oacute;n de <span style="color:red"><strong>cero
	  puntos</strong> sin posibilidad de mejorar el reporte.</a>
	</p>
	</div>
      <div id="pie">
	Actualizado el 25 de agosto del 2021.
	<br>
	URL: https://elisa.dyndns-web.com/teaching/mat/discretas/proyecto.html
      </div>
    </div>
  </BODY>
</HTML>





